
===========================================================================
report_tns
============================================================================
tns -2.44

===========================================================================
report_wns
============================================================================
wns -0.60

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.60

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.22
