###############################################################################
# Created by write_sdc
# Tue Dec 23 20:09:53 2025
###############################################################################
current_design hexbs_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {frame_start_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_x_pos[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mb_y_pos[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_rdata[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ref_start_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_x[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mv_y[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sad[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {mem_addr[31]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[30]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[29]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[28]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[27]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[26]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[25]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[24]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[23]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[22]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[21]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[20]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[19]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[18]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[17]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[16]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[15]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[14]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[13]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[12]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[11]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[10]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[9]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[8]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[7]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[6]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[5]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[4]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[3]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[2]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[1]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[0]}]
set_load -pin_load 0.0334 [get_ports {mv_x[5]}]
set_load -pin_load 0.0334 [get_ports {mv_x[4]}]
set_load -pin_load 0.0334 [get_ports {mv_x[3]}]
set_load -pin_load 0.0334 [get_ports {mv_x[2]}]
set_load -pin_load 0.0334 [get_ports {mv_x[1]}]
set_load -pin_load 0.0334 [get_ports {mv_x[0]}]
set_load -pin_load 0.0334 [get_ports {mv_y[5]}]
set_load -pin_load 0.0334 [get_ports {mv_y[4]}]
set_load -pin_load 0.0334 [get_ports {mv_y[3]}]
set_load -pin_load 0.0334 [get_ports {mv_y[2]}]
set_load -pin_load 0.0334 [get_ports {mv_y[1]}]
set_load -pin_load 0.0334 [get_ports {mv_y[0]}]
set_load -pin_load 0.0334 [get_ports {sad[15]}]
set_load -pin_load 0.0334 [get_ports {sad[14]}]
set_load -pin_load 0.0334 [get_ports {sad[13]}]
set_load -pin_load 0.0334 [get_ports {sad[12]}]
set_load -pin_load 0.0334 [get_ports {sad[11]}]
set_load -pin_load 0.0334 [get_ports {sad[10]}]
set_load -pin_load 0.0334 [get_ports {sad[9]}]
set_load -pin_load 0.0334 [get_ports {sad[8]}]
set_load -pin_load 0.0334 [get_ports {sad[7]}]
set_load -pin_load 0.0334 [get_ports {sad[6]}]
set_load -pin_load 0.0334 [get_ports {sad[5]}]
set_load -pin_load 0.0334 [get_ports {sad[4]}]
set_load -pin_load 0.0334 [get_ports {sad[3]}]
set_load -pin_load 0.0334 [get_ports {sad[2]}]
set_load -pin_load 0.0334 [get_ports {sad[1]}]
set_load -pin_load 0.0334 [get_ports {sad[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frame_start_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_x_pos[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mb_y_pos[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ref_start_addr[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
