
===========================================================================
report_tns
============================================================================
tns -479.94

===========================================================================
report_wns
============================================================================
wns -10.01

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.01

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
